run/tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0.orig/air/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    maxY
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    minX
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    maxX
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    minY
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    maxZ
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    air_to_floor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }

    air_to_solid
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
}


// ************************************************************************* //
